backend/app/views/room_messages/_message.html.erb

INSERT INTO "room_messages" ("color", "created_at", "message", "nickname", "room_id", "updated_at") VALUES ('#c79c8b', '2025-10-27 01:56:53.030372', 'Hallo', 'TamaGo', 1, '2025-10-27 01:56:53.030372') RETURNING "id"
---
      <small class="text-muted">
        <%= room_message.created_at.in_time_zone('Asia/Jakarta').strftime("%d/%m/%Y %H:%M WIB") %>