backend/app/views/rooms/_rooms.html.erb

<script>
  (function () {
    // helper: attach behavior setelah DOM tersedia
    function initRoomSearch() {
      const searchInput = document.getElementById("roomSearch");
      const roomList = document.getElementById("roomList");

      if (!searchInput || !roomList) return;

      // fokus otomatis
      searchInput.focus();

      function getRoomLinks() {
        return Array.from(roomList.querySelectorAll(".room-nav-link"));
      }

      function filterRooms() {
        const term = (searchInput.value || "").trim().toLowerCase();
        const links = getRoomLinks();

        if (!term) {
          // show all
---
SELECT "rooms".* FROM "rooms"