backend/app/controllers/room_messages_controller.rb

      nickname: nickname,
      color: color
    )
    if @room_message.save
---
INSERT INTO "room_messages" ("color", "created_at", "message", "nickname", "room_id", "updated_at") VALUES ('#0a35e2', '2025-10-27 13:22:17.933843', 'Tes', 'Ruby', 1, '2025-10-27 13:22:17.933843') RETURNING "id"

  def set_room
    @room = Room.find(params[:room_id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1