backend/app/controllers/rooms_controller.rb

  def create
    @room = Room.new(permitted_parameters)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("created_at", "name", "updated_at") VALUES ('2025-10-27 08:08:08.189770', 'Room 1', '2025-10-27 08:08:08.189770') RETURNING "id"

  def update
    if @room.update(permitted_parameters)
---
UPDATE "rooms" SET "name" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["name", "Updated Room"], ["updated_at", "2025-10-23 13:49:51.909758"], ["id", 980190962]]

  def show
    @room = Room.find(params[:id])
    @room_messages = @room.room_messages.order(created_at: :asc)
    @room_message = RoomMessage.new(room: @room)

    respond_to do |format|
      format.html
      format.json do
        render json: {
          id: @room.id,
          name: @room.name,
          messages: @room_messages.map do |msg|
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = 3 ORDER BY "room_messages"."created_at" DESC LIMIT 1
SELECT "room_messages".* FROM "room_messages" WHERE "room_messages"."room_id" = 1 ORDER BY "room_messages"."created_at" ASC

  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms"
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1