backend/app/channels/room_channel.rb

  def subscribed
    room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = 1 LIMIT 1